УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/СпособыФормированияСегментов/СпособыФормированияСегментов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыФормированияСегментов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФормироватьВручную</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПериодическиОбновлять</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ЮрЛицоНеРезидент</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Forms/ПомощникНового/Module.bsl
#Область ПеренесеноСДоработками

// Смарт Фролов+ Удаляем из списка выбора "Обособленное подразделение"
// Его необходимо создавать после создания "Головного контрагента"
&НаСервере
Процедура смарт_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Элементы.ВидЮрЛицо.СписокВыбора.Удалить(3);
	Элементы.ЭтоКомпания.ТолькоПросмотр = Не Пользователи.ЭтоПолноправныйПользователь();
	
	//++ смарт:ММ #036 176 17.03.2020 - создание партнеров от дилеров
	АдресДеревоДанных = "";
	АдресТаблицаНайдено = "";
	Если Параметры.Свойство("АдресДеревоДанных", АдресДеревоДанных) 
		И Параметры.Свойство("АдресТаблицаНайдено", АдресТаблицаНайдено) Тогда
		мДеревоЗначений = ПолучитьИзВременногоХранилища(АдресДеревоДанных);
		мТаблицаНайдено = ПолучитьИзВременногоХранилища(АдресТаблицаНайдено);
		ЗначениеВРеквизитФормы(мДеревоЗначений, "ДеревоДанныхНайденныхПартнеров");
		ЗначениеВРеквизитФормы(мТаблицаНайдено, "ТаблицаНайдено");
	КонецЕсли;	
	//-- смарт:ММ 17.03.2020
	
	//++#1012 смарт: Холопов 04.05.2022 // Добавление подсказок для программно добавленных элементов и телефонов в КИ 
	смартОбщегоНазначения.ДобавитьПодсказкиКонтактнаяИнформация(ЭтотОбъект);	
	//--#1012 смарт: Холопов 04.05.2022
	
	//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
	Если Параметры.Свойство("КонтактныеДанныеЛида") И ТипЗнч(Параметры.КонтактныеДанныеЛида) = Тип("Структура") Тогда
		
		ОсновнойМенеджер = Параметры.КонтактныеДанныеЛида.ОсновнойМенеджер;
		ЭтаФорма.смартМенеджерПоРасходнымМатериалам = Параметры.КонтактныеДанныеЛида.ОсновнойМенеджер;
		
		//++ #1690 смарт: Фролов 21.03.2024 //Небольшие доработки CRM по результатам эксплуатации.
		Если Параметры.КонтактныеДанныеЛида.Телефон <> "" Тогда
			
			ТелефонПартнера = Параметры.КонтактныеДанныеЛида.Телефон;
			ЗначенияПолей = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(
				ТелефонПартнера, Перечисления.ТипыКонтактнойИнформации.Телефон);
				
			ДанныеПолей = ОбработатьНомер(ЗначенияПолей);
			ЗначенияПолей = УправлениеКонтактнойИнформациейСлужебный.СтруктураВСтрокуJSON(ДанныеПолей);
			ТелефонПартнераЗначенияПолей = ЗначенияПолей;
			ТелефонКЛ = Параметры.КонтактныеДанныеЛида.Телефон;
			ТелефонКЛЗначенияПолей = ЗначенияПолей;
			
		КонецЕсли;
		//-- #1690 смарт: Фролов 21.03.2024
		
		АдресЭППартнера = Параметры.КонтактныеДанныеЛида.ЭлектроннаяПочта;
		УказатьДанныеКонтактногоЛица = Истина;
		УстановитьДоступностьДанныхКонтактногоЛица(ЭтотОбъект);
		Клиент = Истина;
		ИмяКЛ = Параметры.КонтактныеДанныеЛида.Имя;
		АдресЭПКЛ = Параметры.КонтактныеДанныеЛида.ЭлектроннаяПочта;
		
	КонецЕсли;

	НовыеРеквизиты = Новый Массив;
	смартКонтактноеЛицо = Новый РеквизитФормы("смартКонтактноеЛицо", Новый ОписаниеТипов("СправочникСсылка.КонтактныеЛицаПартнеров"), "");
	НовыеРеквизиты.Добавить(смартКонтактноеЛицо);
	
	ИзменитьРеквизиты(НовыеРеквизиты);
	//-- #1624 смарт: Фролов 13.02.2024
	
КонецПроцедуры

// Смарт Убираем доступность КПП (будет заполнено при проверке по базе ФНС)
// и Кнопки "Далее", для проверки корректности заполнения данных
&НаКлиенте
Процедура смарт_УказыватьЮридическиеРеквизитыПриИзмененииПосле(Элемент)
	Элементы.КПП.Доступность=Не УказыватьЮридическиеРеквизиты;
	Элементы.Далее.Доступность=Не УказыватьЮридическиеРеквизиты;
КонецПроцедуры

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
&НаКлиенте
&ИзменениеИКонтроль("ИННПриИзменении")
Процедура смарт_ИННПриИзменении(Элемент)

	ЮрФизЛицо = ТипЮрФизЛицаКонтрагента(ЭтоКомпания, ВидКомпании);
	
	ИННЗаполненКорректно = Истина;
	ЭтоЮрЛицо = ОбщегоНазначенияУТКлиентСервер.ЭтоЮрЛицо(ЮрФизЛицо);
	
	ТекстСообщения = "";
	Если ПустаяСтрока(ИНН) Тогда
		ИННЗаполненКорректно = Ложь;
	ИначеЕсли НЕ РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, ЭтоЮрЛицо, ТекстСообщения) Тогда
		
		ОчиститьСообщения();
		ИННЗаполненКорректно = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,"ИНН",,);
			
	КонецЕсли;

	Если ИННЗаполненКорректно И НастройкиПодключенияКСервисуИППЗаданы И Не ВидКомпании = 3 Тогда
		
		РезультатЗапуска = ПартнерыИКонтрагентыВызовСервера.ФоновоеЗаданиеДанныеПартнераПоИННЗапустить(ИНН,
		                                                                                               ЮрФизЛицо,
		                                                                                               УникальныйИдентификатор,
		                                                                                               ФоновоеЗаданиеИдентификатор);
		
		ФоновоеЗаданиеИдентификатор  = РезультатЗапуска.ИдентификаторЗадания;
		ФоновоеЗаданиеАдресХранилища = РезультатЗапуска.АдресХранилища;
		
		Если РезультатЗапуска.ЗаданиеЗапущено Тогда
			ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчика);
			ПараметрыОбработчика.ТекущийИнтервал = 2;
			ПодключитьОбработчикОжидания("ФоновоеЗаданиеПроверитьНаКлиенте", 2, Истина);
		Иначе
			ВыполнитьЗаполнениеРеквизитовПоИНН(РезультатЗапуска.РеквизитыКонтрагента);
		КонецЕсли;
		
	КонецЕсли;

	УстановитьДоступностьКнопкиЗаполнитьПоИНН(ЭтотОбъект);
	ОтключитьОтметкуНезаполненного();
	
	#Вставка
	// Смарт Если все проверки по ИНН коректны,
	// тогда кнопка "Далее" доступна.
	смартУстановитьДоступностьКнопкиДалее();
	
	//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
	смартВывестиИнформациюПоКонтрагентуНаСервере(ИНН);
	//-- #Б-1018 смарт: Лопато 07.10.2024
	#КонецВставки

КонецПроцедуры

&НаКлиенте
Процедура смарт_ЗаполнитьПоИННПосле(Команда)
	смартУстановитьДоступностьКнопкиДалее();
КонецПроцедуры
// Фролов- 

&НаСервере
&ИзменениеИКонтроль("ЗаписатьПартнераИСвязанныеДанные")
Процедура смарт_ЗаписатьПартнераИСвязанныеДанные(СписокСозданных)

	Если ДействиеПоРезультатамНайдено <> 0 Тогда

		//Партнер
		ОбъектПартнер = Справочники.Партнеры.СоздатьЭлемент();
		ОбъектПартнер.Наименование                          = Название;
		ОбъектПартнер.Родитель                              = Родитель;
		ОбъектПартнер.БизнесРегион                          = БизнесРегион;
		ОбъектПартнер.ГруппаДоступа                         = ГруппаДоступа;
		ОбъектПартнер.ДатаРегистрации                       = ТекущаяДатаСеанса();
		ОбъектПартнер.Клиент                                = Клиент;
		ОбъектПартнер.Конкурент                             = Конкурент;
		ОбъектПартнер.Поставщик                             = Поставщик;
		ОбъектПартнер.ОбслуживаетсяТорговымиПредставителями = ОбслуживаетсяТорговымиПредставителями;
		ОбъектПартнер.ПрочиеОтношения                       = ПрочиеОтношения;
		ОбъектПартнер.ОсновнойМенеджер                      = ОсновнойМенеджер;
		ОбъектПартнер.НаименованиеПолное                    = НаименованиеПартнера();
		ОбъектПартнер.ЮрФизЛицо                             = ТипЮрФизЛицаПартнера(ЭтоКомпания);
		ОбъектПартнер.Пол                                   = Пол;
		ОбъектПартнер.ДатаРождения                          = ДатаРождения;
		ОбъектПартнер.Перевозчик                            = Перевозчик;
		ОбъектПартнер.ВариантОтправкиЭлектронногоЧека       = ВариантОтправкиЭлектронногоЧека;
		
		#Вставка
		//++ #1615 смарт: Мосолов 25.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
		
		ОбъектПартнер.смартМенеджерПоРасходнымМатериалам    = ЭтаФорма.смартМенеджерПоРасходнымМатериалам;
		ОбъектПартнер.смартОсновнойМенеджерСервисЦентра     = ЭтаФорма.смартОсновнойМенеджерСервисЦентра;

		//-- #1615 смарт: Мосолов 25.01.2024 
		#КонецВставки

		// контактная информация партнера
		Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.АдресПартнера;
			НоваяСтрокаКИ.Представление     = ФактическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей     = ФактическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресЗначенияПолей");
		КонецЕсли;

		Если ЭтоКомпания = 0 Тогда
			ИмяРеквизитаТелефон = "ТелефонПартнера";
			ИмяРеквизитаТелефонЗначенияПолей = "ТелефонПартнераЗначенияПолей";
			ИмяРеквизитаАдресЭП = "АдресЭППартнера";
		Иначе
			ИмяРеквизитаТелефон = "ТелефонПартнераФизЛицо";
			ИмяРеквизитаТелефонЗначенияПолей = "ТелефонПартнераФизЛицоЗначенияПолей";
			ИмяРеквизитаАдресЭП = "АдресЭППартнераФизЛицо";
		КонецЕсли;

		Если ЗначенияПолейВСписокЗначений(ЭтаФорма[ИмяРеквизитаТелефонЗначенияПолей]).Количество()> 0 Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.ТелефонПартнера;
			НоваяСтрокаКИ.Представление     = ЭтаФорма[ИмяРеквизитаТелефон];
			НоваяСтрокаКИ.ЗначенияПолей     = ЭтаФорма[ИмяРеквизитаТелефонЗначенияПолей];
			НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер(ИмяРеквизитаТелефонЗначенияПолей);
			#Вставка
			//++ #1584 смарт: Фролов 29.12.2023 //Исправить сохранение телефонного номера при добавлении клиента через форму ПомощникНового
			ДанныеСтруктура = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(НоваяСтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
			НоваяСтрокаКИ.НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеСтруктура.value);
			НоваяСтрокаКИ.НомерТелефонаБезКодов = ДанныеСтруктура.number;
			//-- #1584 смарт: Фролов 29.12.2023
			#КонецВставки
		КонецЕсли;

		Если Не ПустаяСтрока(ЭтаФорма[ИмяРеквизитаАдресЭП]) Тогда
			НоваяСтрокаКИ = ОбъектПартнер.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.EmailПартнера;
			НоваяСтрокаКИ.Представление     = ЭтаФорма[ИмяРеквизитаАдресЭП];
			НоваяСтрокаКИ.Значение     		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
			НоваяСтрокаКИ.ЗначенияПолей     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
			НоваяСтрокаКИ.АдресЭП           = ЭтаФорма[ИмяРеквизитаАдресЭП];
			Поз = СтрНайти(ЭтаФорма[ИмяРеквизитаАдресЭП], "@");
			Если Поз <> 0 Тогда
				НоваяСтрокаКИ.ДоменноеИмяСервера = Сред(ЭтаФорма[ИмяРеквизитаАдресЭП], Поз+1);
			КонецЕсли;
		КонецЕсли;

		// СтандартныеПодсистемы.Свойства
		УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ПартнерОбъектДопРеквизиты);
		ОбъектПартнер.ДополнительныеРеквизиты.Загрузить(ПартнерОбъектДопРеквизиты.ДополнительныеРеквизиты.Выгрузить());
		// Конец СтандартныеПодсистемы.Свойства

		ОбъектПартнер.Записать();
		ПартнерВыбор = ОбъектПартнер.Ссылка;
		СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ПартнерВыбор), ОбъектПартнер.Наименование);

		// зафиксировать первичный интерес
		Если ПолучитьФункциональнуюОпцию("ФиксироватьПервичныйИнтерес") И ЗначениеЗаполнено(КаналПервичногоИнтереса) Тогда

			УстановитьПривилегированныйРежим(Истина);
			Запись = РегистрыСведений.ИсточникиПервичногоИнтереса.СоздатьМенеджерЗаписи();
			Запись.Партнер                    = ПартнерВыбор;
			Запись.КаналПервичногоИнтереса    = КаналПервичногоИнтереса;
			Запись.ИсточникПервичногоИнтереса = ИсточникПервичногоИнтереса;
			Запись.Записать();
			УстановитьПривилегированныйРежим(Ложь);

		КонецЕсли;

		//сегмент
		Если ЗначениеЗаполнено(Сегмент)
			И ЕстьПравоВключенияВСегмент
			И Сегмент.СпособФормирования = Перечисления.СпособыФормированияСегментов.ФормироватьВручную Тогда
			СегментыСервер.ДобавитьПартнераВСегмент(Сегмент, ПартнерВыбор);
		КонецЕсли;

		// Контактное лицо
		#Удаление //++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
		Если ЭтоКомпания = 0 И УказатьДанныеКонтактногоЛица И НЕ ПустаяСтрока(ФамилияКЛ) Тогда
		#КонецУдаления	

		#Вставка
		//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
		Если ЭтоКомпания = 0 И УказатьДанныеКонтактногоЛица Тогда
		//-- #1624 смарт: Фролов 13.02.2024
		#КонецВставки
	
			ОбъектКонтактноеЛицо = Справочники.КонтактныеЛицаПартнеров.СоздатьЭлемент();
			ОбъектКонтактноеЛицо.Владелец               = ПартнерВыбор;
			ОбъектКонтактноеЛицо.ДатаРегистрацииСвязи   = ТекущаяДатаСеанса();
			
			#Удаление //++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
			ОбъектКонтактноеЛицо.Наименование           = ФИО_ОднойСтрокой(ФамилияКЛ, ИмяКЛ, ОтчествоКЛ);
			#КонецУдаления
			
			#Вставка
			//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
			Если ПустаяСтрока(ФамилияКЛ) Тогда
				ОбъектКонтактноеЛицо.Наименование        = ИмяКЛ + "" + ОтчествоКЛ;
			Иначе
				ОбъектКонтактноеЛицо.Наименование        = ФИО_ОднойСтрокой(ФамилияКЛ, ИмяКЛ, ОтчествоКЛ);
			КонецЕсли;	
			//-- #1624 смарт: Фролов 13.02.2024
			#КонецВставки
			
			ОбъектКонтактноеЛицо.Автор                  = Пользователи.ТекущийПользователь();
			Если Не Роль.Пустая() Тогда
				СтрокаРоли = ОбъектКонтактноеЛицо.РолиКонтактногоЛица.Добавить();
				СтрокаРоли.РольКонтактногоЛица = Роль;
			КонецЕсли;

			Если Не ПустаяСтрока(АдресЭПКЛ) Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = АдресЭПКЛ;
				НоваяСтрокаКИ.Значение		    = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
				НоваяСтрокаКИ.ЗначенияПолей     = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияВXML(НоваяСтрокаКИ.Значение, НоваяСтрокаКИ.Представление, НоваяСтрокаКИ.Вид);
				НоваяСтрокаКИ.АдресЭП           = АдресЭПКЛ;
				Поз = СтрНайти(АдресЭПКЛ, "@");
				Если Поз <> 0 Тогда
					НоваяСтрокаКИ.ДоменноеИмяСервера = Сред(АдресЭПКЛ, Поз+1);
				КонецЕсли;
			КонецЕсли;

			Если ЗначенияПолейВСписокЗначений(ТелефонКЛЗначенияПолей).Количество()> 0 Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = ТелефонКЛ;
				НоваяСтрокаКИ.ЗначенияПолей     = ТелефонКЛЗначенияПолей;
				НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонКЛЗначенияПолей");
				#Вставка
				//++ #1584 смарт: Фролов 29.12.2023 //Исправить сохранение телефонного номера при добавлении клиента через форму ПомощникНового
				ДанныеСтруктура = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(НоваяСтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
				НоваяСтрокаКИ.НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеСтруктура.value);
				НоваяСтрокаКИ.НомерТелефонаБезКодов = ДанныеСтруктура.number;
				//-- #1584 смарт: Фролов 29.12.2023
				#КонецВставки
			КонецЕсли;

			Если ЗначенияПолейВСписокЗначений(МобильныйТелефонКЛЗначенияПолей).Количество()> 0 Тогда
				НоваяСтрокаКИ = ОбъектКонтактноеЛицо.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип               = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид               = Справочники.ВидыКонтактнойИнформации.МобильныйТелефонКонтактногоЛица;
				НоваяСтрокаКИ.Представление     = МобильныйТелефонКЛ;
				НоваяСтрокаКИ.ЗначенияПолей     = МобильныйТелефонКЛЗначенияПолей;
				НоваяСтрокаКИ.Значение          = ЗначениеКонтактнойИнформацииJSONСервер("МобильныйТелефонКЛЗначенияПолей");
				#Вставка
				//++ #1584 смарт: Фролов 29.12.2023 //Исправить сохранение телефонного номера при добавлении клиента через форму ПомощникНового
				ДанныеСтруктура = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(НоваяСтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
				НоваяСтрокаКИ.НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеСтруктура.value);
				НоваяСтрокаКИ.НомерТелефонаБезКодов = ДанныеСтруктура.number;
				//-- #1584 смарт: Фролов 29.12.2023
				#КонецВставки
			КонецЕсли;

			ОбъектКонтактноеЛицо.Записать();
			СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ОбъектКонтактноеЛицо.Ссылка), ОбъектКонтактноеЛицо.Наименование);
			
			#Вставка
			//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
			ЭтаФорма.смартКонтактноеЛицо = ОбъектКонтактноеЛицо.Ссылка;
			//-- #1624 смарт: Фролов 13.02.2024
			#КонецВставки
			
		КонецЕсли;

	КонецЕсли;

	//Контрагент
	Если ИспользуютсяТолькоПартнеры Или (ДействиеСКонтрагентом = 1 И НЕ НаОснованииКонтрагента И УказыватьЮридическиеРеквизиты) Тогда

		ОбъектКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		ОбъектКонтрагент.Наименование          = ?(ИспользуютсяТолькоПартнеры, Название, НаименованиеКонтрагента());
		ОбъектКонтрагент.ЮрФизЛицо             = ТипЮрФизЛицаКонтрагента(ЭтоКомпания, ВидКомпании);
		ОбъектКонтрагент.НДСПоСтавкам4и2       = ?(Поставщик И ЭтоКомпания = 0 И ВидКомпании <> 1, НДСПоСтавкам4и2, Ложь);
		ОбъектКонтрагент.ИНН                   = ?(ЭтоКомпания = 0,?(ВидКомпании <> 1,ИНН,""),ИННПартнерФизЛицо);
		ОбъектКонтрагент.КПП                   = ?(ЭтоКомпания = 0 И (ВидКомпании = 0 Или ВидКомпании = 3),КПП,"");
		ОбъектКонтрагент.КодПоОКПО             = ?(ЭтоКомпания = 0 И ВидКомпании <> 1,КодПоОКПО,"");
		ОбъектКонтрагент.Партнер               = ПартнерВыбор;
		ОбъектКонтрагент.НаименованиеПолное    = ?(ЭтоКомпания = 0,ПолноеЮридическоеНаименование,ФИО_ОднойСтрокой(ФамилияПартнера, ИмяПартнера, ОтчествоПартнера));
		ОбъектКонтрагент.СтранаРегистрации     = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, СтранаРегистрации, Справочники.СтраныМира.Россия);
		ОбъектКонтрагент.РегистрационныйНомер  = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, РегистрационныйНомер, "");
		ОбъектКонтрагент.НалоговыйНомер        = ?(ОбъектКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицоНеРезидент, НалоговыйНомер, "");

		ОбъектКонтрагент.ИсторияКПП.Загрузить(ИсторияКПП.Выгрузить());
		ОбъектКонтрагент.ИсторияНаименований.Загрузить(ИсторияНаименований.Выгрузить());

		// контактная информация контрагента
		Если НЕ ПустаяСтрока(ФактическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			НоваяСтрокаКИ.Представление = ФактическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресЗначенияПолей");
		КонецЕсли;

		Если ИсторияКонтактнойИнформации.Количество() > 0 Тогда
			ПартнерыИКонтрагенты.ВключитьХранениеИсторииИзменений("ЮрАдресКонтрагента");
			ИсторияКонтактнойИнформации[0].Дата = Неопределено;
			УправлениеКонтактнойИнформацией.УстановитьКонтактнуюИнформациюОбъекта(ОбъектКонтрагент, ИсторияКонтактнойИнформации);
		ИначеЕсли НЕ ПустаяСтрока(ЮридическийАдрес) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
			НоваяСтрокаКИ.Представление = ЮридическийАдрес;
			НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресЗначенияПолей;
			НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ЮридическийАдресЗначенияПолей");
		КонецЕсли;

		Если ЭтоКомпания = 0 И НЕ ПустаяСтрока(ТелефонПартнера) Тогда

			Если ИспользуютсяТолькоПартнеры Тогда

				НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
				НоваяСтрокаКИ.Представление = ТелефонПартнера;
				НоваяСтрокаКИ.ЗначенияПолей = ТелефонПартнераЗначенияПолей;
				НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонПартнераЗначенияПолей");
				#Вставка
				//++ #1584 смарт: Фролов 29.12.2023 //Исправить сохранение телефонного номера при добавлении клиента через форму ПомощникНового
				ДанныеСтруктура = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(НоваяСтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
				НоваяСтрокаКИ.НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеСтруктура.value);
				НоваяСтрокаКИ.НомерТелефонаБезКодов = ДанныеСтруктура.number;
				//-- #1584 смарт: Фролов 29.12.2023
				#КонецВставки
				
			Иначе

				Если ИНН = ИННИсточникДанныхЗаполнения Тогда

					НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
					НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
					НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
					НоваяСтрокаКИ.Представление = ТелефонКонтрагента;
					НоваяСтрокаКИ.ЗначенияПолей = ТелефонКонтрагентаЗначенияПолей;
					НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонКонтрагентаЗначенияПолей");
					#Вставка
					//++ #1584 смарт: Фролов 29.12.2023 //Исправить сохранение телефонного номера при добавлении клиента через форму ПомощникНового
					ДанныеСтруктура = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(НоваяСтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
					НоваяСтрокаКИ.НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеСтруктура.value);
					НоваяСтрокаКИ.НомерТелефонаБезКодов = ДанныеСтруктура.number;
					//-- #1584 смарт: Фролов 29.12.2023
					#КонецВставки
					
				КонецЕсли;

			КонецЕсли;

		КонецЕсли;


		Если ЭтоКомпания = 1 И НЕ ПустаяСтрока(ТелефонПартнераФизЛицо) Тогда
			НоваяСтрокаКИ = ОбъектКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Телефон;
			НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			НоваяСтрокаКИ.Представление = ТелефонПартнераФизЛицо;
			НоваяСтрокаКИ.ЗначенияПолей = ТелефонПартнераФизЛицоЗначенияПолей;
			НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ТелефонПартнераФизЛицоЗначенияПолей");;
			#Вставка
			//++ #1584 смарт: Фролов 29.12.2023 //Исправить сохранение телефонного номера при добавлении клиента через форму ПомощникНового
			ДанныеСтруктура = УправлениеКонтактнойИнформациейСлужебный.JSONВКонтактнуюИнформациюПоПолям(НоваяСтрокаКИ.Значение, Перечисления.ТипыКонтактнойИнформации.Телефон);
			НоваяСтрокаКИ.НомерТелефона = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(ДанныеСтруктура.value);
			НоваяСтрокаКИ.НомерТелефонаБезКодов = ДанныеСтруктура.number;
			//-- #1584 смарт: Фролов 29.12.2023
			#КонецВставки
		КонецЕсли;

		// головной контрагент
		Если ЭтоКомпания = 0 И ВидКомпании = 3 Тогда

			ОбъектКонтрагент.ОбособленноеПодразделение = Истина;

			Если ИспользуютсяТолькоПартнеры Или ВыбратьГоловногоКонтрагента = 0 Тогда
				ОбъектКонтрагент.ГоловнойКонтрагент = ГоловнойКонтрагент;
			ИначеЕсли ВыбратьГоловногоКонтрагента = 1 Тогда

				ОбъектГоловнойКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();

				ОбъектГоловнойКонтрагент.Наименование       = НаименованиеГоловногоКонтрагента;
				ОбъектГоловнойКонтрагент.НаименованиеПолное = ПолноеНаименованиеГоловногоКонтрагента;
				ОбъектГоловнойКонтрагент.ЮрФизЛицо          = Перечисления.ЮрФизЛицо.ЮрЛицо;
				ОбъектГоловнойКонтрагент.ИНН                = ИНН;
				ОбъектГоловнойКонтрагент.КПП                = КППГоловногоКонтрагента;
				ОбъектГоловнойКонтрагент.КодПоОКПО          = КодПоОКПОГоловногоКонтрагента;

				ОбъектГоловнойКонтрагент.Партнер = ?(ЗначениеЗаполнено(ПартнерГоловногоКонтрагента),
				ПартнерГоловногоКонтрагента, ПартнерВыбор);

				// контактная информация головного контрагента
				Если НЕ ПустаяСтрока(ФактическийАдресГоловногоКонтрагента) Тогда
					НоваяСтрокаКИ = ОбъектГоловнойКонтрагент.КонтактнаяИнформация.Добавить();
					НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
					НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
					НоваяСтрокаКИ.Представление = ФактическийАдресГоловногоКонтрагента;
					НоваяСтрокаКИ.ЗначенияПолей = ФактическийАдресГоловногоКонтрагентаЗначенияПолей;
					НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ФактическийАдресГоловногоКонтрагентаЗначенияПолей");
				КонецЕсли;

				Если НЕ ПустаяСтрока(ЮридическийАдресГоловногоКонтрагента) Тогда
					НоваяСтрокаКИ = ОбъектГоловнойКонтрагент.КонтактнаяИнформация.Добавить();
					НоваяСтрокаКИ.Тип           = Перечисления.ТипыКонтактнойИнформации.Адрес;
					НоваяСтрокаКИ.Вид           = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
					НоваяСтрокаКИ.Представление = ЮридическийАдресГоловногоКонтрагента;
					НоваяСтрокаКИ.ЗначенияПолей = ЮридическийАдресГоловногоКонтрагентаЗначенияПолей;
					НоваяСтрокаКИ.Значение      = ЗначениеКонтактнойИнформацииJSONСервер("ЮридическийАдресГоловногоКонтрагентаЗначенияПолей");
				КонецЕсли;

				ОбъектГоловнойКонтрагент.Записать();
				СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(ОбъектГоловнойКонтрагент.Ссылка), ОбъектГоловнойКонтрагент.Наименование);
				ОбъектКонтрагент.ГоловнойКонтрагент = ОбъектГоловнойКонтрагент.Ссылка;

				// банковский счет головного контрагента
				Если УказатьБанковскийСчетГоловногоКонтрагента Тогда

					Валютный = (ВалютаДенежныхСредствГоловнойКонтрагент <> ВалютаРеглУчета);

					БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
					БанковскийСчет.Владелец = ОбъектГоловнойКонтрагент.Ссылка;
					БанковскийСчет.Наименование = АвтоНаименованиеБанковскогоСчета(
					НомерСчетаГоловногоКонтрагента, БанкГоловнойКонтрагент, ВалютаДенежныхСредствГоловнойКонтрагент);
					БанковскийСчет.ВалютаДенежныхСредств = ВалютаДенежныхСредствГоловнойКонтрагент;
					БанковскийСчет.НомерСчета = НомерСчетаГоловногоКонтрагента;
					БанковскийСчет.Банк = БанкГоловнойКонтрагент;
					БанковскийСчет.БанкДляРасчетов = БанкДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.СчетВБанкеДляРасчетов = СчетВБанкеДляРасчетовГоловнойКонтрагент;

					Если ИностранныйБанкГоловнойКонтрагент = 1 Тогда
						БанковскийСчет.ИностранныйБанк = Истина;
						БанковскийСчет.РучноеИзменениеРеквизитовБанка = Истина;
						БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Истина;
						БанковскийСчет.БИКБанка = БИКБанкаГоловнойКонтрагент;
					Иначе
						БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Валютный;
					КонецЕсли;

					БанковскийСчет.БИКБанкаДляРасчетов = БИКБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.НаименованиеБанка = НаименованиеБанкаГоловнойКонтрагент;
					БанковскийСчет.НаименованиеБанкаДляРасчетов = НаименованиеБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.АдресБанка = АдресБанкаГоловнойКонтрагент;
					БанковскийСчет.АдресБанкаДляРасчетов = АдресБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.СВИФТБанка = СВИФТБанкаГоловнойКонтрагент;
					БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетовГоловнойКонтрагент;
					БанковскийСчет.КоррСчетБанкаДляРасчетов = КоррСчетБанкаДляРасчетовГоловнойКонтрагент;

					БанковскийСчет.Записать();
					СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(БанковскийСчет.Ссылка), БанковскийСчет.Наименование);

				КонецЕсли;

			КонецЕсли;
		КонецЕсли;

		ОбъектКонтрагент.Записать();
		КонтрагентВыбор = ОбъектКонтрагент.Ссылка;
		СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(КонтрагентВыбор), ОбъектКонтрагент.Наименование);

		// банковский счет
		Если УказатьБанковскийСчетКонтрагента Тогда

			Валютный = (ВалютаДенежныхСредств <> ВалютаРеглУчета);

			БанковскийСчет = Справочники.БанковскиеСчетаКонтрагентов.СоздатьЭлемент();
			БанковскийСчет.Владелец = КонтрагентВыбор;
			БанковскийСчет.Наименование = АвтоНаименованиеБанковскогоСчета(НомерСчета, Банк, ВалютаДенежныхСредств);
			БанковскийСчет.ВалютаДенежныхСредств = ВалютаДенежныхСредств;
			БанковскийСчет.НомерСчета = НомерСчета;
			БанковскийСчет.Банк = Банк;
			БанковскийСчет.БанкДляРасчетов = БанкДляРасчетов;
			БанковскийСчет.СчетВБанкеДляРасчетов = СчетВБанкеДляРасчетов;

			Если ИностранныйБанк = 1 Тогда
				БанковскийСчет.ИностранныйБанк = Истина;
				БанковскийСчет.РучноеИзменениеРеквизитовБанка = Истина;
				БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Истина;
				БанковскийСчет.БИКБанка = БИКБанка;
			Иначе
				БанковскийСчет.РучноеИзменениеРеквизитовБанкаДляРасчетов = Валютный;
			КонецЕсли;

			БанковскийСчет.БИКБанкаДляРасчетов = БИКБанкаДляРасчетов;
			БанковскийСчет.НаименованиеБанка = НаименованиеБанка;
			БанковскийСчет.НаименованиеБанкаДляРасчетов = НаименованиеБанкаДляРасчетов;
			БанковскийСчет.АдресБанка = АдресБанка;
			БанковскийСчет.АдресБанкаДляРасчетов = АдресБанкаДляРасчетов;
			БанковскийСчет.СВИФТБанка = СВИФТБанка;
			БанковскийСчет.СВИФТБанкаДляРасчетов = СВИФТБанкаДляРасчетов;
			БанковскийСчет.КоррСчетБанкаДляРасчетов = КоррСчетБанкаДляРасчетов;

			БанковскийСчет.Записать();
			СписокСозданных.Добавить(ПолучитьНавигационнуюСсылку(БанковскийСчет.Ссылка), БанковскийСчет.Наименование);

		КонецЕсли;

		Если ЭтоКомпания = 1 И УказыватьЮридическиеРеквизиты И УказатьДокументУдостоверяющийЛичность Тогда

			МенеджерЗаписи = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Активность                               = Истина;
			МенеджерЗаписи.Период                                   = ТекущаяДатаСеанса();
			МенеджерЗаписи.Физлицо                                  = КонтрагентВыбор;
			МенеджерЗаписи.ВидДокумента                             = ВидДокумента;
			МенеджерЗаписи.Серия                                    = СерияДокумента;
			МенеджерЗаписи.Номер                                    = НомерДокумента;
			МенеджерЗаписи.ДатаВыдачи                               = ДатаВыдачи;
			МенеджерЗаписи.СрокДействия                             = СрокДействия;
			МенеджерЗаписи.КемВыдан                                 = КемВыданДокумент;
			МенеджерЗаписи.КодПодразделения                         = КодПодразделения;
			МенеджерЗаписи.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
			МенеджерЗаписи.Записать();

		КонецЕсли;

		// привязка обособленных подразделений
		Если ЭтоКомпания = 0 И ВидКомпании = 0 И ЗначениеЗаполнено(ИНН) И ПривязатьОбособленныеПодразделения = 0 Тогда

			Для Каждого СтрокаТаблицы Из ОбособленныеПодразделения Цикл
				Если СтрокаТаблицы.Выбран Тогда

					ОписаниеОшибки = "";
					ПартнерыИКонтрагентыВызовСервера.ИзменитьГоловногоКонтрагента(СтрокаТаблицы.Контрагент, КонтрагентВыбор, ОписаниеОшибки);

					Если НЕ ПустаяСтрока(ОписаниеОшибки) Тогда
						ВызватьИсключение ОписаниеОшибки;
					КонецЕсли;

				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

	КонецЕсли;

	Если НаОснованииКонтрагента И ЗначениеЗаполнено(КонтрагентОснование) Тогда

		ВыполнитьЗаписьКонтрагентаОснование(ПартнерВыбор, КонтрагентОснование);

	КонецЕсли;

	СозданиеВыполнено = Истина;

	СегментыСервер.ПроверитьВхождениеПартнераВСегментыПриСоздании(ПартнерВыбор);

КонецПроцедуры 

&НаКлиенте
//++ #1624 смарт: Фролов 13.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Процедура смарт_ПередЗакрытиемПосле(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ПараметрыДляЛида = Новый Структура;
	ПараметрыДляЛида.Вставить("СозданиеВыполнено", СозданиеВыполнено);
	ПараметрыДляЛида.Вставить("ПартнерВыбор", ПартнерВыбор);
	ПараметрыДляЛида.Вставить("КонтактноеЛицо", ЭтаФорма.смартКонтактноеЛицо);
	
	Оповестить("ОповещениеОНовомПартнереЛиду", ПараметрыДляЛида, ЭтаФорма);
	
КонецПроцедуры //-- #1624 смарт: Фролов 13.02.2024

#КонецОбласти


#Область ДоработкиСмарт

// Смарт Фролов+ 
// Процедура управляет доступностью кнопки "Далее" и выводит декорацию с ошибкой.
&НаСервере
Процедура смартУстановитьДоступностьКнопкиДалее()
	
	Если Пользователи.РолиДоступны("ПолныеПрава,смартРедактированиеКонтрагентовСДвижениями") Тогда
		//{[+](фрагмент ДОБАВЛЕН), Подкин Алексей 19.11.2019 10:38:22
		Элементы.Далее.Доступность=Истина;
		//}Подкин Алексей 19.11.2019 10:38:22
		Возврат;
	КонецЕсли;	
	Если УказыватьЮридическиеРеквизиты И ПустаяСтрока(ПолноеЮридическоеНаименование) Тогда 
		Элементы.Далее.Доступность=Ложь;
		Эл=Элементы.Добавить("смартИнфОшибка",Тип("ДекорацияФормы"),Элементы.СтраницаПервичнаяИнформация);
		Эл.Вид=ВидДекорацииФормы.Надпись;
		Эл.ЦветТекста=WebЦвета.Красный;
		Эл.Заголовок="По контрагенту нет данных в ФНС";
	Иначе
		Элементы.Далее.Доступность=Истина;
		Если Не Элементы.Найти("смартИнфОшибка")=Неопределено Тогда 
			Элементы.Удалить(Элементы.смартИнфОшибка);
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

// Фролов-

//++#1012 смарт: Холопов 04.05.2022 // Добавление подсказок для программно добавленных элементов и телефонов в КИ 
&НаКлиенте
&После("ОбработкаСобытияЭлементаКИТелефон")
Процедура смарт_ОбработкаСобытияЭлементаКИТелефон(Элемент, ВидКонтактнойИнформации, ИмяРеквизитаПредставление, ИмяРеквизитаЗначенияПолей, Событие)
	
	Если Событие = "ПриИзменении" Тогда
		
		СтруктураТелефона = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Элемент.ТекстРедактирования);
		
		Представление = УправлениеКонтактнойИнформациейКлиентСервер.СформироватьПредставлениеТелефона(СтруктураТелефона.КодСтраны, СтруктураТелефона.КодГорода, СтруктураТелефона.НомерТелефона, СтруктураТелефона.Добавочный, "");
		
		ЭтаФорма[ИмяРеквизитаПредставление] = Представление;
		
		ЗначенияПолей = Новый Структура;
		
		ЗначенияПолей.Вставить("countryCode", СтруктураТелефона.КодСтраны);
		ЗначенияПолей.Вставить("areaCode", СтруктураТелефона.КодГорода);
		ЗначенияПолей.Вставить("number", СтруктураТелефона.НомерТелефона);
		ЗначенияПолей.Вставить("extNumber", СтруктураТелефона.Добавочный);
		ЗначенияПолей.Вставить("value", Представление);
		
		Значение = CRM_ОбщегоНазначенияСервер.СтруктураВСтрокуJSON(ЗначенияПолей);
		
		ЭтаФорма[ИмяРеквизитаЗначенияПолей] = Значение;
		
		СтруктураДанныхСтроки = Новый Структура();
		
		СтруктураДанныхСтроки.Вставить("Значение",Значение);
		СтруктураДанныхСтроки.Вставить("Представление",Представление);

		//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
		СтруктураДанныхСтроки.Вставить("Ссылка", ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		СтруктураДанныхСтроки.Вставить("Владелец", Неопределено);
		//-- #1152 смарт: Лопато 18.10.2024
		
		ИтогПроверки = смартОбщегоНазначения.ПроверитьТелефон(СтруктураДанныхСтроки); 
		
		Если ИтогПроверки.КодОшибки <> 0 Тогда

			//++ #1152 смарт: Лопато 18.10.2024 //Партнеры. Не контролируется уникальность КИ при изменении.  
			ОчиститьСообщения();

			Если ИтогПроверки.КодОшибки = 12 И ИтогПроверки.Свойство("МассивДублей") Тогда
				
				ОбщегоНазначенияКлиент.СообщитьПользователю(ИтогПроверки.СообщениеОшибки, , Элемент.Имя);
				
				Для Каждого ЭлементДубль Из ИтогПроверки.МассивДублей Цикл
					ОбщегоНазначенияКлиент.СообщитьПользователю(ЭлементДубль.ТекстСообщения, ЭлементДубль.Ключ);
				КонецЦикла;
				
			Иначе	

				СообщениеОбщееПояснение = "Если номер имеет другой формат (например, это заграничный номер), нажмите на кнопку выбора или F4 и введите номер";		
				СообщениеДляВывода = ИтогПроверки.СообщениеОшибки + Символы.ПС + СообщениеОбщееПояснение; 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеДляВывода, , Элемент.Имя);
				
			КонецЕсли;

			ЭтаФорма[ИмяРеквизитаПредставление] = "";
			//-- #1152 смарт: Лопато 18.10.2024
	
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
&После("АдресЭППартнераПриИзменении")
Процедура смарт_АдресЭППартнераПриИзменении(Элемент)
	смартОбщегоНазначенияКлиент.ПроверитьПочтуПриИзменении(Элемент,ПолучитьПустуюСсылку("Партнер"),ЭтаФорма);
КонецПроцедуры

&НаКлиенте
&После("АдресЭПКЛПриИзменении")
Процедура смарт_АдресЭПКЛПриИзменении(Элемент)
	смартОбщегоНазначенияКлиент.ПроверитьПочтуПриИзменении(Элемент,ПолучитьПустуюСсылку("КЛ"),ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция  ПолучитьПустуюСсылку(Справочник)
	
	Если Справочник = "Партнер" Тогда
		Возврат Справочники.Партнеры.ПустаяСсылка();	
	ИначеЕсли Справочник = "КЛ" Тогда
		Возврат Справочники.КонтактныеЛицаПартнеров.ПустаяСсылка();	
	КонецЕсли;
	

КонецФункции 

//--#1012 смарт: Холопов 04.05.2022

//++ #1615 смарт: Мосолов 25.01.2024 //Заполнение и передача на сайт менеджеров по расходым материалам
&НаКлиенте
&ИзменениеИКонтроль("ДополнительныеСведенияЗаполненыНеправильно")
Функция смарт_ДополнительныеСведенияЗаполненыНеправильно()

	Отказ = Ложь;
	ОчиститьСообщения();

	Если НЕ Клиент И НЕ Поставщик И НЕ ПрочиеОтношения И НЕ Конкурент Тогда
		ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо определить хотя бы один тип отношений'"),"Клиент");
		Отказ = Истина;
	КонецЕсли;

	Если ИспользуютсяГруппыДоступаПартнеров
		И ГруппаДоступа = ПредопределенноеЗначение("Справочник.ГруппыДоступаПартнеров.ПустаяСсылка") Тогда
		ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать группу доступа'"),"ГруппаДоступа");
		Отказ = Истина;
	КонецЕсли;

	Если ПустаяСтрока(Название) Тогда
		ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать рабочее наименование'"),"Название");
		Отказ = Истина;
	КонецЕсли;

	Если ЭтоКомпания = 0 Тогда

		Если УказыватьЮридическиеРеквизиты 
			И ЮрАдресКонтрагентаОбязателен
			И Не ЗначениеЗаполнено(ЮридическийАдрес) Тогда

			ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать юридический адрес'"), "ЮридическийАдрес");
			Отказ = Истина;

		КонецЕсли;

		Если УказыватьЮридическиеРеквизиты 
			И ФактАдресКонтрагентаОбязателен
			И Не ЗначениеЗаполнено(ФактическийАдрес) Тогда

			ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать фактический адрес'"), "ФактическийАдрес");
			Отказ = Истина;

		КонецЕсли;

	Иначе

		Если ТребуетсяУказаниеАдресаЧастногоЛица(ЭтотОбъект) Тогда

			ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать адрес проживания'"), "ЮридическийАдрес");
			Отказ = Истина;

		КонецЕсли;

	КонецЕсли;
	
	#Вставка 
	//++ #1615 смарт: Мосолов 29.01.2024 //Заполнение и передача на сайт менеджеров по расходным материалам
	
	Если Не ЗначениеЗаполнено(ОсновнойМенеджер) Тогда
		
		ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать основного менеджера партнера'"), "ОсновнойМенеджер");
		Отказ = Истина;
		
	КонецЕсли;
	
	//++#1615 смарт: Лопато 08.02.2024 //Заполнение и передача на сайт менеджеров по расходым материалам  
	//Если Не ЗначениеЗаполнено(смартМенеджерПоРасходнымМатериалам) Тогда
	//	
	//	ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать менеджера по расходным материалам'"), "смартМенеджерПоРасходнымМатериалам");
	//	Отказ = Истина;
	//	
	//КонецЕсли;
	//--#1615 смарт: Лопато 08.02.2024
	
	Если Не ЗначениеЗаполнено(БизнесРегион) Тогда
		
		ВывестиСообщениеПользователю(НСтр("ru = 'Необходимо указать бизнес-регион'"), "БизнесРегион");
		Отказ = Истина;
		
	КонецЕсли; 
	
	//-- #1615 смарт: Мосолов 29.01.2024 
	#КонецВставки
	
	Возврат Отказ;

КонецФункции 	//-- #1615 смарт: Мосолов 25.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, ПартнерВыбор);
	
КонецПроцедуры //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь; 
		
	Если СтрДлина(СокрЛП(Текст)) >= 3 Тогда
		
		ДанныеВыбора = смартПолучитьДанныеВыбораБизнесРегиона(Текст); 
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьДанныеВыбораБизнесРегиона(Текст) 
	
	Возврат Справочники.БизнесРегионы.смартПолучитьДанныеВыбораБизнесРегиона(Текст);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 09.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаКлиенте
Процедура смартБизнесРегионОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда 
		
		ВыбранноеЗначение = смартСоздатьБизнесРегион(ВыбранноеЗначение);  
		
	Иначе
		
		СтруктураВозврата = смартПолучитьУровеньКодСубьектаСправочника(ВыбранноеЗначение); 
		
		Если СтруктураВозврата.Уровень = 0 ИЛИ (СтруктураВозврата.Уровень = 1 И СтруктураВозврата.КодСубъекта <> 0) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Для субъектов РФ необходимо выбрать населенный пункт'"));
			
			ВыбранноеЗначение = ПредопределенноеЗначение("Справочник.БизнесРегионы.ПустаяСсылка");  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //-- #1537 смарт: Мосолов 09.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартСоздатьБизнесРегион(ВыбранноеЗначение) 
	
	Возврат Справочники.БизнесРегионы.смартСоздатьБизнесРегион(ВыбранноеЗначение);

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

//++ #1537 смарт: Мосолов 11.01.2024 //Запрет создания элементов справочника Бизнес-регионы 
&НаСервереБезКонтекста
Функция смартПолучитьУровеньКодСубьектаСправочника(ЭлементСправочника) 
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Уровень", ЭлементСправочника.Уровень());
	СтруктураВозврата.Вставить("КодСубъекта", ЭлементСправочника.СмартКодСубъектаРФ);
	
	Возврат СтруктураВозврата;

КонецФункции //-- #1537 смарт: Мосолов 11.01.2024

&НаСервере
//++ #1624 смарт: Фролов 22.02.2024 //Автоматическое распределение лидов. Работа менеджера с лидом.
Функция ОбработатьНомер(ДанныеСтроки)
	
	врКодСтраны	= Неопределено;
	врКодГорода	= Неопределено;
	врНомерТелефона	= Неопределено;
	врПредставление	= Неопределено;
	Представление = "";
	// -СофтФон
	ЗначенияПолей = CRM_ОбщегоНазначенияСервер.JSONВКонтактнуюИнформациюПоПолям(ДанныеСтроки, Перечисления.ТипыКонтактнойИнформации.Телефон);
	
	Если ЗначениеЗаполнено(ЗначенияПолей.value) И НЕ (Представление = ЗначенияПолей.value) Тогда
		Представление = ЗначенияПолей.value;
		БылиВнесеныИзменения = Истина;
	КонецЕсли;	
	
	врПредставление	= "";
	// -СофтФон
	// +СофтФон
	Для Каждого СтрокаЗначения Из ЗначенияПолей Цикл
		
		Если СтрокаЗначения.Ключ = "value" Тогда
			Если ЗначениеЗаполнено(СтрокаЗначения.Значение) И НЕ (Представление = СтрокаЗначения.Значение) Тогда
				Представление = СтрокаЗначения.Значение;
				БылиВнесеныИзменения = Истина;
			КонецЕсли;	
			врПредставление	= "";
		ИначеЕсли СтрокаЗначения.Ключ = "countryCode" Тогда
			врКодСтраны = СокрЛП(СтрокаЗначения.Значение); 
		ИначеЕсли СтрокаЗначения.Ключ = "areaCode" Тогда
			врКодГорода = СокрЛП(СтрокаЗначения.Значение); 
		ИначеЕсли СтрокаЗначения.Ключ = "number" Тогда
			врНомерТелефона = СокрЛП(СтрокаЗначения.Значение); 
		КонецЕсли;
		
	КонецЦикла;
	
	// +СофтФон
	Если врКодСтраны = Неопределено Тогда
		ЗначенияПолей.Вставить("countryCode", "");
	КонецЕсли;
	
	Если врКодГорода = Неопределено Тогда
		ЗначенияПолей.Вставить("areaCode", "");
	КонецЕсли;
	
	Если врНомерТелефона = Неопределено Тогда
		ЗначенияПолей.Вставить("number", "");
	КонецЕсли;
	
	Если врПредставление = Неопределено Тогда
		ЗначенияПолей.Вставить("value", "");
	КонецЕсли;
	
	врПредставление = сфпСофтФонПроСервер.сфпУбратьИзНомераТелефонаВсеПрефиксы(Представление, Ложь);
	
	Если ЗначениеЗаполнено(врПредставление) Тогда
		Если СтрДлина(врПредставление) > 5 Тогда
			// В представлении есть номер телефона.
			ПараметрыСервера = сфпСофтФонПроСервер.сфпПараметрыСервера();
			
			// Получаем структуру полей по представлению.
			СтруктураНомера = сфпСофтФонПроСервер.сфпЗаполнитьСтруктуруПолейПоПредставлениюТелефон(Представление);
			
			// Если не заполнены код страны или код города, то заполняем их по умолчанию.
			Если НЕ ЗначениеЗаполнено(СтруктураНомера.КодСтраны) Тогда
				СтруктураНомера.КодСтраны = ПараметрыСервера.КодСтраны;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтруктураНомера.КодГорода) Тогда
				СтруктураНомера.КодГорода = ПараметрыСервера.КодГорода;
			КонецЕсли;
			
			// Заполняем значения из структуры.
			Если НЕ (ЗначенияПолей.countryCode = СтруктураНомера.КодСтраны) Тогда
				ЗначенияПолей.Вставить("countryCode", СтруктураНомера.КодСтраны);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ (ЗначенияПолей.areaCode = СтруктураНомера.КодГорода) Тогда
				ЗначенияПолей.Вставить("areaCode", СтруктураНомера.КодГорода);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ (ЗначенияПолей.number = СтруктураНомера.НомерТелефона) Тогда
				ЗначенияПолей.Вставить("number", СтруктураНомера.НомерТелефона);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ (ЗначенияПолей.value = Представление) Тогда
				ЗначенияПолей.Вставить("value", Представление);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ (ЗначенияПолей.extNumber = СтруктураНомера.Добавочный) Тогда
				ЗначенияПолей.Вставить("extNumber", СтруктураНомера.Добавочный);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
		Иначе	
			// Заполним код страны и код города по умолчанию.
			ПараметрыСервера = сфпСофтФонПроСервер.сфпПараметрыСервера();
			
			Если НЕ ЗначениеЗаполнено(ЗначенияПолей.countryCode) Тогда
				ЗначенияПолей.Вставить("countryCode", ПараметрыСервера.КодСтраны);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЗначенияПолей.areaCode) 
				И ((СтрДлина(ПараметрыСервера.КодГорода) + СтрДлина(врПредставление)) = 10) Тогда
				ЗначенияПолей.Вставить("areaCode", ПараметрыСервера.КодГорода);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ (ЗначенияПолей.number = врПредставление) Тогда
				ЗначенияПолей.Вставить("number", врПредставление);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
			Если НЕ (ЗначенияПолей.value = Представление) Тогда
				ЗначенияПолей.Вставить("value", Представление);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;
			
		КонецЕсли;
	Иначе	
		// Если это новый номер, то заполним код страны и код города по умолчанию.
		ПараметрыСервера = сфпСофтФонПроСервер.сфпПараметрыСервера();
		Если ПустаяСтрока(ЗначенияПолей.countryCode) Тогда
			ЗначенияПолей.Вставить("countryCode", ПараметрыСервера.КодСтраны);
			БылиВнесеныИзменения = Истина;
		КонецЕсли;
		
		Если СтрНайти(CRM_ОбщегоНазначенияСервер.ПолучитьЗначениеРеквизита(ДанныеСтроки.Вид, "ИмяПредопределенныхДанных"), "Мобильный") = 0 Тогда
			Если ПустаяСтрока(ЗначенияПолей.areaCode) Тогда
				ЗначенияПолей.Вставить("areaCode", ПараметрыСервера.КодГорода);
				БылиВнесеныИзменения = Истина;
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗначенияПолей;
	
КонецФункции //-- #1624 смарт: Фролов 22.02.2024	

//++ #Б-1018 смарт: Лопато 07.10.2024 //Вывод информации о контрагенте полученной из DaData  
&НаСервере
Процедура смартВывестиИнформациюПоКонтрагентуНаСервере(ИНН)

	Попытка
	
		смартИнтеграцияDaData.ВывестиНаФормуИнформациюПоКонтрагенту(ИНН, ЭтотОбъект);

	Исключение

		ТекстСообщения = "Возникла ошибка при запросе данных контрагента из сервиса DaData по ИНН: " 
						 + ИНН + Символы.ПС + ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);

		ЗаписьЖурналаРегистрации("Ошибка при выводе информации из DaData", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
	
	КонецПопытки
	
КонецПроцедуры //-- #Б-1018 смарт: Лопато 07.10.2024

#КонецОбласти
